/*Напишите программу, которая будет выдавать
название дня недели по заданному номеру.
3 -> Среда
5 -> Пятница*/

Console.WriteLine("Введите число в диапазоне от 1 до 7:");
string number = (Console.ReadLine());
if ()