/*Задача 52: 
Задайте двумерный массив из целых чисел.
Найдите среднее арифметическое элементов в каждом столбце.

Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
Среднее арифметическое каждого
столбца: 4,6; 5,6; 3,6; 3. */

int[,] matrixRndInt = CreateMatrixRndInt(4, 8, 1, 9);
PrintMatrix(matrixRndInt);

Console.WriteLine();
Console.WriteLine("Среднее арифметическое каждого столбца: ");
PrintArray(ArithmeticMeanOfArrayColumns(matrixRndInt));

//Метод, создающий двумерный массив
int[,] CreateMatrixRndInt(int rows, int columns, int min, int max)
{
    int[,] matrix = new int[rows, columns]; // 0, 1
    Random rnd = new Random();

    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i, j] = rnd.Next(min, max + 1);
        }
    }
    return matrix;
}

//Вывод двумерного массива в терминал
void PrintMatrix(int[,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        // Console.Write();
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            if (j < matrix.GetLength(1) - 1) Console.Write($"{matrix[i, j],3}");
            else Console.Write($"{matrix[i, j],3}  ");
        }
        Console.WriteLine();
    }
}

//Расчёт среднего арифметического каждого столбца массива
double[] ArithmeticMeanOfArrayColumns(int[,] matrix)
{
        double[] arr = new double[matrix.GetLength(1)];

    for (int i = 0; i < matrix.GetLength(1); i++)
    {
        double sum = 0;
        for (int j = 0; j < matrix.GetLength(0); j++)
        {
            sum += matrix[j, i];
        }
        arr[i] = Math.Round(sum / matrix.GetLength(0), 1);
    }
    return arr;
}

//Вывод одномерного массива в терминал
void PrintArray(double[] arr)
{
    // Console.WriteLine();
    for (int i = 0; i < arr.Length; i++)
    {
        if (i < arr.Length - 1) Console.Write(arr[i] + "; ");
        else Console.Write(arr[i]);
    }
    // Console.WriteLine("]");
}